Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer
The Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer class implements the drawing logic for handles.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.viewManager
The Tekla.BIM.DirectManipulation.Adapters.IGraphicsViewHandler exposing all views to draw to.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.handleBitmapDrawer
The Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapDrawer to draw handle bitmaps for point handles with.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.pointHandlesGraphics
The map of point handles and their bitmap graphics, drawn by Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.handleBitmapDrawer.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.otherHandlesGraphics
The map of all non-point handles and their graphics, drawn to the views of Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.viewManager.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.#ctor(Tekla.BIM.DirectManipulation.Adapters.IGraphicsViewHandler)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer class.
viewManager: The Tekla.BIM.DirectManipulation.Adapters.IGraphicsViewHandler to visualize the handles with.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.DrawHandle(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic)
Draws or updates the given handle to the view.
visualizationData: The handle to draw or update.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.RemoveHandle(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic)
Removes the given handle from the view.
visualizationData: The handle to remove.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.GetHandleFromGraphicId(System.Int32)
Gets the drawn handle from the graphic identifier.
id: The identifier.
Returns: The drawn handle from the graphic identifier.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.DrawCursor``1(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic{``0},System.Boolean)
Draws or updates the cursor as a handle.
The type of geometry data attached to the visualizationData.
visualizationData: The handle to draw or update.
setCursor: The flag indicates to set or unset the cursor.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.DrawPointHandle(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic{Tekla.Common.Geometry.Vector3})
Draws the point handle.
pointHandle: The target point handle.
Returns: The drawn graphic identifier.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.OnViewOpened(Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsView)
Handles the opening of new views.
view: The newly opened view.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer.OnViewChanged(System.Object,Tekla.BIM.DirectManipulation.Services.Graphics.GraphicsViewChangedEventArgs)
Called when the view has been changed.
sender: The sender.
graphicsViewChangedEventArgs: The Tekla.BIM.DirectManipulation.Services.Graphics.GraphicsViewChangedEventArgs instance containing the event data.